
INSERT INTO employee (full_name, phone, email, hire_date)
VALUES
    ('Иванов Сергей Петрович', '+79031234567', 'ivanov@bank.ru', '2020-03-12'),
    ('Петрова Анна Викторовна', '+79035554422', 'petrova@bank.ru', '2021-06-05'),
    ('Сидоров Максим Андреевич', '+79039997711', 'sidorov@bank.ru', '2019-09-18'),
    ('Кузнецова Ольга Павловна', '+79032228811', 'kuznetsova@bank.ru', '2022-01-11'),
    ('Орлов Дмитрий Николаевич', '+79036667788', 'orlov@bank.ru', '2018-07-21');

INSERT INTO currency (code, name, updated_by)
VALUES
    ('RUB', 'Российский рубль', 1),
    ('USD', 'Доллар США', 2),
    ('EUR', 'Евро', 3),
    ('GBP', 'Фунт стерлингов', 4),
    ('CNY', 'Китайский юань', 5);

INSERT INTO client (full_name, birth_date, passport, phone, email)
VALUES
    ('Смирнов Алексей Иванович', '1985-04-22', '4012123456', '+79101112233', 'smirnov@mail.ru'),
    ('Ковалёва Наталья Петровна', '1992-11-10', '4012987654', '+79105557788', 'kovaleva@mail.ru'),
    ('Морозов Дмитрий Олегович', '1979-06-14', '4012765432', '+79103334455', 'morozov@mail.ru'),
    ('Васильева Ольга Николаевна', '1990-02-05', '4012543211', '+79107778899', 'vasilieva@mail.ru'),
    ('Фёдоров Михаил Сергеевич', '1988-12-19', '4012233445', '+79104445566', 'fedorov@mail.ru'),
    ('Попова Елена Владимировна', '1995-03-30', '4012333567', '+79109998877', 'popova@mail.ru'),
    ('Громов Андрей Викторович', '1983-07-18', '4012777888', '+79102223344', 'gromov@mail.ru'),
    ('Беляева Анна Сергеевна', '1998-09-09', '4012999111', '+79106665544', 'belyaeva@mail.ru');

INSERT INTO account (client_id, account_number, account_type, currency_id, balance)
VALUES
    (1, '408178100000000001', 'Дебетовый', 1, 152340.50),
    (1, '408178400000000002', 'Валютный', 2, 2200.75),
    (2, '408178100000000003', 'Дебетовый', 1, 95670.00),
    (2, '408178400000000004', 'Валютный', 3, 1200.00),
    (3, '408178100000000005', 'Дебетовый', 1, 534000.00),
    (4, '408178100000000006', 'Дебетовый', 1, 75680.25),
    (5, '408178400000000007', 'Валютный', 2, 1300.50),
    (6, '408178100000000008', 'Дебетовый', 1, 15890.00),
    (7, '408178400000000009', 'Валютный', 4, 740.00),
    (8, '408178100000000010', 'Дебетовый', 1, 45000.00);

INSERT INTO transaction (account_id, currency_id, amount, transaction_type, description)
VALUES
    (1, 1, 5000.00, 'Пополнение', 'Перевод с зарплатного счета'),
    (1, 1, -1500.00, 'Снятие', 'Оплата коммунальных услуг'),
    (2, 2, 200.00, 'Пополнение', 'Зачисление средств из PayPal'),
    (3, 1, -500.00, 'Снятие', 'Покупка в магазине'),
    (4, 3, 300.00, 'Пополнение', 'Возврат по заказу'),
    (5, 1, -10000.00, 'Снятие', 'Оплата кредита'),
    (5, 1, 25000.00, 'Пополнение', 'Зарплата'),
    (6, 1, 1500.00, 'Пополнение', 'Перевод от клиента №1'),
    (7, 2, -200.00, 'Снятие', 'Оплата авиабилета'),
    (8, 1, 10000.00, 'Пополнение', 'Премия'),
    (9, 4, 50.00, 'Пополнение', 'Зачисление бонусов'),
    (10, 1, -2000.00, 'Снятие', 'Оплата интернет-магазина');
